; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v1 ?v7)
             (pred_8 ?v5 ?v12)
             (pred_4 ?v1 ?v12)
             (pred_6 ?v9 ?v1 )
	     (pred_3 ?v1)
             (pred_2 ?v8)
             (pred_12 ?v5)
             (pred_10 ?v12)
             (pred_11 ?v1)
             (pred_9 ?v5)
             (pred_7 ?v1)
             (pred_5 ))



(:action op_4
:parameters (?v13 ?v4 ?v6 ?v2)
:precondition (and (pred_2 ?v13) (pred_2 ?v4) (pred_12 ?v6) (pred_10 ?v2)
          (pred_1 ?v13 ?v4) (pred_8 ?v6 ?v2)
                   (pred_4 ?v4 ?v2) (pred_3 ?v13) 
                   (pred_11 ?v4) (pred_9 ?v6))
:effect (and  (pred_7 ?v4) (not (pred_11 ?v4))))


(:action op_2
:parameters (?v13 ?v10)
:precondition (and (pred_2 ?v13) (pred_2 ?v10)
               (pred_3 ?v13) (pred_1 ?v13 ?v10) (pred_7 ?v10))
:effect (and (pred_3 ?v10) (not (pred_3 ?v13))))

(:action op_3
:parameters (?v13 ?v6)
:precondition (and (pred_2 ?v13) (pred_12 ?v6) 
                  (pred_3 ?v13) (pred_6 ?v6 ?v13) (pred_5 ))
:effect (and (pred_9 ?v6)
   (not (pred_6 ?v6 ?v13)) (not (pred_5 ))))


(:action op_1
:parameters (?v13 ?v3 ?v11)
:precondition (and (pred_2 ?v13) (pred_12 ?v3) (pred_12 ?v11)
                  (pred_3 ?v13) (pred_9 ?v11) (pred_6 ?v3 ?v13))
:effect (and (pred_9 ?v3) (pred_6 ?v11 ?v13)
        (not (pred_9 ?v11)) (not (pred_6 ?v3 ?v13))))

(:action op_5
:parameters (?v13 ?v6)
:precondition (and (pred_2 ?v13) (pred_12 ?v6) 
                  (pred_3 ?v13) (pred_9 ?v6))
:effect (and (pred_5 ) (pred_6 ?v6 ?v13) (not (pred_9 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_01 obj_10 obj_16 obj_03 obj_18 obj_08 obj_12 obj_13 obj_17 obj_09 obj_05 obj_11 obj_20 obj_06 obj_07
    obj_21 obj_15 obj_22
    obj_19 obj_04 obj_14
    )

    (:init
       (pred_5)

       (pred_2 obj_02)
       (pred_2 obj_01)
       (pred_2 obj_10)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_2 obj_18)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_13)
       (pred_2 obj_17)
       (pred_2 obj_09)
       (pred_2 obj_05)
       (pred_2 obj_11)
       (pred_2 obj_20)
       (pred_2 obj_06)
       (pred_2 obj_07)
       (pred_10 obj_21)
       (pred_10 obj_15)
       (pred_10 obj_22)
       (pred_12 obj_19)
       (pred_12 obj_04)
       (pred_12 obj_14)

       (pred_1 obj_02 obj_03)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_16)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_16 obj_12)
       (pred_1 obj_16 obj_10)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_18)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_18 obj_03)
       (pred_1 obj_08 obj_09)
       (pred_1 obj_08 obj_12)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_16)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_17)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_17 obj_20)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_17 obj_13)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_05)
       (pred_1 obj_09 obj_08)
       (pred_1 obj_09 obj_17)
       (pred_1 obj_05 obj_07)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_05 obj_09)
       (pred_1 obj_11 obj_20)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_20 obj_06)
       (pred_1 obj_20 obj_17)
       (pred_1 obj_20 obj_11)
       (pred_1 obj_06 obj_07)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_06 obj_20)
       (pred_1 obj_07 obj_05)
       (pred_1 obj_07 obj_06)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_4  obj_13 obj_21)
       (pred_4  obj_09 obj_15)
       (pred_4  obj_01 obj_22)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_03)
       (pred_7 obj_18)
       (pred_7 obj_08)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_20)
       (pred_7 obj_06)
       (pred_7 obj_07)

       (pred_8  obj_19 obj_21)
       (pred_8  obj_04 obj_15)
       (pred_8  obj_14 obj_22)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_14 obj_03)
       (pred_3 obj_06)
    )

    (:goal (and
       (pred_6 obj_04 obj_05)
    ))
(:constraints
  (always (not (pred_3 obj_12)))
)
)

; plan
1. (op_2 obj_06 obj_20)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_20)
   goals met: 0 of 1
2. (op_2 obj_20 obj_17)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_17)
   goals met: 0 of 1
3. (op_2 obj_17 obj_18)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_18)
   goals met: 0 of 1
4. (op_2 obj_18 obj_08)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_08)
   goals met: 0 of 1
5. (op_2 obj_08 obj_10)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_10)
   goals met: 0 of 1
6. (op_2 obj_10 obj_16)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_16)
   goals met: 0 of 1
7. (op_3 obj_16 obj_04)
   deleted: (pred_6 obj_04 obj_16) (pred_5)
   added: (pred_9 obj_04)
   goals met: 0 of 1
8. (op_2 obj_16 obj_10)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_10)
   goals met: 0 of 1
9. (op_2 obj_10 obj_08)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_08)
   goals met: 0 of 1
10. (op_4 obj_08 obj_09 obj_04 obj_15)
   deleted: (pred_11 obj_09)
   added: (pred_7 obj_09)
   goals met: 0 of 1
11. (op_2 obj_08 obj_09)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_09)
   goals met: 0 of 1
12. (op_2 obj_09 obj_05)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_05)
   goals met: 0 of 1
13. (op_5 obj_05 obj_04)
   deleted: (pred_9 obj_04)
   added: (pred_5) (pred_6 obj_04 obj_05)
   goals met: 1 of 1
